---
kind: property
id: P:Autodesk.Revit.DB.Macros.MacroModule.Description
source: html/a047222b-cccb-dcdc-ef88-323caff17d40.htm
---
# Autodesk.Revit.DB.Macros.MacroModule.Description Property

The module description.

## Syntax (C#)
```csharp
public string Description { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null
- **Autodesk.Revit.Exceptions.InvalidOperationException** - When setting this property: Cannot modify the Module description due to no permission.